In [6]:
import pandas as pd
import numpy as np

In [2]:
ser = pd.Series(range(5), index=list("abcde"))
ser

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [3]:
ser.loc[["a", "c", "e"]]

a    0
c    2
e    4
dtype: int64

In [7]:
df = pd.DataFrame(np.arange(25).reshape(5, 5), index=list("abcde"), columns=list("abcde"))
df

    a   b   c   d   e
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [8]:
df.loc[["a", "c", "e"], ["b", "d"]]

    b   d
a   1   3
c  11  13
e  21  23

In [9]:
dates = pd.date_range('1/1/2000', periods=8)

df = pd.DataFrame(np.random.randn(8, 4),

                  index=dates, columns=['A', 'B', 'C', 'D'])



df

                   A         B         C         D
2000-01-01 -0.018492  0.704924  0.761786  1.084438
2000-01-02  0.497136 -0.114484  1.184610  0.756158
2000-01-03 -0.116372 -0.708337  0.949433  0.054825
2000-01-04 -0.064605 -0.689296  0.310550  0.471620
2000-01-05  0.207694 -0.818026  0.359911  0.346075
2000-01-06 -0.337750  0.812771  0.645985  0.119537
2000-01-07 -0.844191 -0.117398 -0.905368 -0.365953
2000-01-08 -0.121758  0.439313 -0.726344  0.969090

In [11]:
s = df['A']
s

2000-01-01   -0.018492
2000-01-02    0.497136
2000-01-03   -0.116372
2000-01-04   -0.064605
2000-01-05    0.207694
2000-01-06   -0.337750
2000-01-07   -0.844191
2000-01-08   -0.121758
Freq: D, Name: A, dtype: float64

In [12]:
s[dates[5]]

-0.3377502112409749

In [13]:
df[['B', 'A']] = df[['A', 'B']]

In [14]:
df

                   A         B         C         D
2000-01-01  0.704924 -0.018492  0.761786  1.084438
2000-01-02 -0.114484  0.497136  1.184610  0.756158
2000-01-03 -0.708337 -0.116372  0.949433  0.054825
2000-01-04 -0.689296 -0.064605  0.310550  0.471620
2000-01-05 -0.818026  0.207694  0.359911  0.346075
2000-01-06  0.812771 -0.337750  0.645985  0.119537
2000-01-07 -0.117398 -0.844191 -0.905368 -0.365953
2000-01-08  0.439313 -0.121758 -0.726344  0.969090

In [15]:
df[['A', 'B']]

                   A         B
2000-01-01  0.704924 -0.018492
2000-01-02 -0.114484  0.497136
2000-01-03 -0.708337 -0.116372
2000-01-04 -0.689296 -0.064605
2000-01-05 -0.818026  0.207694
2000-01-06  0.812771 -0.337750
2000-01-07 -0.117398 -0.844191
2000-01-08  0.439313 -0.121758

In [18]:
df.loc[:, ['B', 'A']]

                   B         A
2000-01-01 -0.018492  0.704924
2000-01-02  0.497136 -0.114484
2000-01-03 -0.116372 -0.708337
2000-01-04 -0.064605 -0.689296
2000-01-05  0.207694 -0.818026
2000-01-06 -0.337750  0.812771
2000-01-07 -0.844191 -0.117398
2000-01-08 -0.121758  0.439313

In [16]:
df.loc[:, ['B', 'A']] = df[['A', 'B']]

In [17]:
df[['A', 'B']]

                   A         B
2000-01-01  0.704924 -0.018492
2000-01-02 -0.114484  0.497136
2000-01-03 -0.708337 -0.116372
2000-01-04 -0.689296 -0.064605
2000-01-05 -0.818026  0.207694
2000-01-06  0.812771 -0.337750
2000-01-07 -0.117398 -0.844191
2000-01-08  0.439313 -0.121758

In [19]:
df.loc[:, ['B', 'A']] = df[['A', 'B']].to_numpy()

df[['A', 'B']]

                   A         B
2000-01-01 -0.018492  0.704924
2000-01-02  0.497136 -0.114484
2000-01-03 -0.116372 -0.708337
2000-01-04 -0.064605 -0.689296
2000-01-05  0.207694 -0.818026
2000-01-06 -0.337750  0.812771
2000-01-07 -0.844191 -0.117398
2000-01-08 -0.121758  0.439313

In [67]:
df.iloc[:, [1, 0]] = df[['A', 'B']]

In [68]:
df[['A', 'B']]

                   A         B
2000-01-01 -0.018492  0.704924
2000-01-02  0.497136 -0.114484
2000-01-03 -0.116372 -0.708337
2000-01-04 -0.064605 -0.689296
2000-01-05  0.207694 -0.818026
2000-01-06 -0.337750  0.812771
2000-01-07 -0.844191 -0.117398
2000-01-08 -0.121758  0.439313

In [69]:
sa = pd.Series([1, 2, 3], index=list('abc'))

dfa = df.copy()

In [70]:
sa

a    1
b    2
c    3
dtype: int64

In [71]:
sa.b

2

In [72]:
dfa

                   A         B         C         D
2000-01-01 -0.018492  0.704924  0.761786  1.084438
2000-01-02  0.497136 -0.114484  1.184610  0.756158
2000-01-03 -0.116372 -0.708337  0.949433  0.054825
2000-01-04 -0.064605 -0.689296  0.310550  0.471620
2000-01-05  0.207694 -0.818026  0.359911  0.346075
2000-01-06 -0.337750  0.812771  0.645985  0.119537
2000-01-07 -0.844191 -0.117398 -0.905368 -0.365953
2000-01-08 -0.121758  0.439313 -0.726344  0.969090

In [73]:
dfa.A

2000-01-01   -0.018492
2000-01-02    0.497136
2000-01-03   -0.116372
2000-01-04   -0.064605
2000-01-05    0.207694
2000-01-06   -0.337750
2000-01-07   -0.844191
2000-01-08   -0.121758
Freq: D, Name: A, dtype: float64

In [74]:
sa.a = 5

In [75]:
sa

a    5
b    2
c    3
dtype: int64

In [76]:
dfa.A = list(range(len(dfa.index)))  # ok if A already exists

dfa

            A         B         C         D
2000-01-01  0  0.704924  0.761786  1.084438
2000-01-02  1 -0.114484  1.184610  0.756158
2000-01-03  2 -0.708337  0.949433  0.054825
2000-01-04  3 -0.689296  0.310550  0.471620
2000-01-05  4 -0.818026  0.359911  0.346075
2000-01-06  5  0.812771  0.645985  0.119537
2000-01-07  6 -0.117398 -0.905368 -0.365953
2000-01-08  7  0.439313 -0.726344  0.969090

In [77]:
dfa['E'] = list(range(len(dfa.index)))  # use this form to create a new column

dfa

            A         B         C         D  E
2000-01-01  0  0.704924  0.761786  1.084438  0
2000-01-02  1 -0.114484  1.184610  0.756158  1
2000-01-03  2 -0.708337  0.949433  0.054825  2
2000-01-04  3 -0.689296  0.310550  0.471620  3
2000-01-05  4 -0.818026  0.359911  0.346075  4
2000-01-06  5  0.812771  0.645985  0.119537  5
2000-01-07  6 -0.117398 -0.905368 -0.365953  6
2000-01-08  7  0.439313 -0.726344  0.969090  7

In [78]:
x = pd.DataFrame({'x': [1, 2, 3], 'y': [3, 4, 5]})
x

   x  y
0  1  3
1  2  4
2  3  5

In [79]:
x.iloc[1] = {'x': 9, 'y': 99}

x

   x   y
0  1   3
1  9  99
2  3   5

In [80]:
df_new = pd.DataFrame({'one': [1., 2., 3.]})

df_new.two = [4, 5, 6]

df_new

C:\Users\YOSSI\AppData\Local\Temp\ipykernel_9696\179865747.py:3: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df_new.two = [4, 5, 6]

   one
0  1.0
1  2.0
2  3.0

In [81]:
s[:5]

0    a
3    b
2    c
5    d
4    e
dtype: object

In [82]:
s[::2]

0    a
2    c
4    e
dtype: object

In [83]:
s[::-1]

2    f
4    e
5    d
2    c
3    b
0    a
dtype: object

In [84]:
s2 = s.copy()

s2[:5] = 0

s2

0    0
3    0
2    0
5    0
4    0
2    f
dtype: object

In [85]:
df

                   A         B         C         D
2000-01-01 -0.018492  0.704924  0.761786  1.084438
2000-01-02  0.497136 -0.114484  1.184610  0.756158
2000-01-03 -0.116372 -0.708337  0.949433  0.054825
2000-01-04 -0.064605 -0.689296  0.310550  0.471620
2000-01-05  0.207694 -0.818026  0.359911  0.346075
2000-01-06 -0.337750  0.812771  0.645985  0.119537
2000-01-07 -0.844191 -0.117398 -0.905368 -0.365953
2000-01-08 -0.121758  0.439313 -0.726344  0.969090

In [86]:
df[:3]

                   A         B         C         D
2000-01-01 -0.018492  0.704924  0.761786  1.084438
2000-01-02  0.497136 -0.114484  1.184610  0.756158
2000-01-03 -0.116372 -0.708337  0.949433  0.054825

In [87]:
df[::-1]

                   A         B         C         D
2000-01-08 -0.121758  0.439313 -0.726344  0.969090
2000-01-07 -0.844191 -0.117398 -0.905368 -0.365953
2000-01-06 -0.337750  0.812771  0.645985  0.119537
2000-01-05  0.207694 -0.818026  0.359911  0.346075
2000-01-04 -0.064605 -0.689296  0.310550  0.471620
2000-01-03 -0.116372 -0.708337  0.949433  0.054825
2000-01-02  0.497136 -0.114484  1.184610  0.756158
2000-01-01 -0.018492  0.704924  0.761786  1.084438

In [88]:
df[1:3]

                   A         B         C         D
2000-01-02  0.497136 -0.114484  1.184610  0.756158
2000-01-03 -0.116372 -0.708337  0.949433  0.054825

In [89]:
dfl = pd.DataFrame(np.random.randn(5, 4),

                   columns=list('ABCD'),

                   index=pd.date_range('20130101', periods=5))



dfl

                   A         B         C         D
2013-01-01  1.166739 -0.103917  0.728420  1.402263
2013-01-02 -0.641193  0.604753 -0.662412  1.769018
2013-01-03  0.899476 -0.747283 -0.510363 -2.046850
2013-01-04 -1.187993  0.299069 -1.750283  1.014947
2013-01-05  0.509435  0.692138 -0.705382 -0.094198

In [90]:
dfl.loc['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.641193  0.604753 -0.662412  1.769018
2013-01-03  0.899476 -0.747283 -0.510363 -2.046850
2013-01-04 -1.187993  0.299069 -1.750283  1.014947

In [91]:
s1 = pd.Series(np.random.randn(6), index=list('abcdef'))

s1

a   -0.431427
b    1.296593
c    0.239141
d   -0.550996
e   -0.688228
f   -0.140459
dtype: float64

In [92]:
s1.loc['c':]

c    0.239141
d   -0.550996
e   -0.688228
f   -0.140459
dtype: float64

In [93]:
s1.loc['b']

1.2965933458233103

In [94]:
s1.loc['c':] = 0

s1

a   -0.431427
b    1.296593
c    0.000000
d    0.000000
e    0.000000
f    0.000000
dtype: float64

In [95]:
df1 = pd.DataFrame(np.random.randn(6, 4),

                   index=list('abcdef'),

                   columns=list('ABCD'))



df1

          A         B         C         D
a -0.215846  0.960554  0.178910  0.170734
b  0.785262 -2.136579  0.958048  0.366978
c  1.782522  1.360081 -0.618000 -0.479022
d  0.663605  0.224581 -1.142250 -1.774177
e  0.259797  1.588402 -3.308435  1.072413
f -0.376108  1.470646 -0.437669  0.859513

In [96]:
df1.loc[['a', 'b', 'd'], :]

          A         B         C         D
a -0.215846  0.960554  0.178910  0.170734
b  0.785262 -2.136579  0.958048  0.366978
d  0.663605  0.224581 -1.142250 -1.774177

In [97]:
df1.loc['d':, 'A':'C']

          A         B         C
d  0.663605  0.224581 -1.142250
e  0.259797  1.588402 -3.308435
f -0.376108  1.470646 -0.437669

In [98]:
df1.loc['a']

A   -0.215846
B    0.960554
C    0.178910
D    0.170734
Name: a, dtype: float64

In [99]:
df1.loc['a'] > 0

A    False
B     True
C     True
D     True
Name: a, dtype: bool

In [100]:

df1.loc[:, df1.loc['a'] > 0]

          B         C         D
a  0.960554  0.178910  0.170734
b -2.136579  0.958048  0.366978
c  1.360081 -0.618000 -0.479022
d  0.224581 -1.142250 -1.774177
e  1.588402 -3.308435  1.072413
f  1.470646 -0.437669  0.859513

In [101]:
mask = pd.array([True, False, True, False, pd.NA, False], dtype="boolean")

mask

<BooleanArray>
[True, False, True, False, <NA>, False]
Length: 6, dtype: boolean

In [102]:
df1[mask]

          A         B        C         D
a -0.215846  0.960554  0.17891  0.170734
c  1.782522  1.360081 -0.61800 -0.479022

In [103]:
df1.loc['a', 'A']

-0.2158460009047361

In [104]:
s = pd.Series(list('abcde'), index=[0, 3, 2, 5, 4])

s.loc[3:5]

3    b
2    c
5    d
dtype: object

In [105]:
s.sort_index()

0    a
2    c
3    b
4    e
5    d
dtype: object

In [108]:
s.sort_index().loc[1:6]

2    c
3    b
4    e
5    d
dtype: object

In [109]:
s = pd.Series(list('abcdef'), index=[0, 3, 2, 5, 4, 2])

s.loc[3:5]

3    b
2    c
5    d
dtype: object

In [111]:
s1 = pd.Series(np.random.randn(5), index=list(range(0, 10, 2)))

s1

0    0.655734
2   -0.852712
4    0.684015
6    0.269035
8   -0.158749
dtype: float64

In [112]:
s1.iloc[:3]

0    0.655734
2   -0.852712
4    0.684015
dtype: float64

In [113]:
s1.iloc[3]

0.269035065964279

In [114]:
s1.iloc[:3] = 0

s1

0    0.000000
2    0.000000
4    0.000000
6    0.269035
8   -0.158749
dtype: float64

In [115]:
df1 = pd.DataFrame(np.random.randn(6, 4),

                   index=list(range(0, 12, 2)),

                   columns=list(range(0, 8, 2)))



df1

           0         2         4         6
0   0.363970  0.409596 -0.070671  0.805560
2   0.084384  0.356211 -1.659930 -0.029844
4  -0.894287 -1.550663 -0.282028 -0.537922
6   1.041357  0.346913  0.454570  0.056707
8   0.511938  0.583622  0.013645 -0.450921
10 -0.893408 -1.586541  2.090660  0.357855

In [116]:
df1.iloc[:3]

          0         2         4         6
0  0.363970  0.409596 -0.070671  0.805560
2  0.084384  0.356211 -1.659930 -0.029844
4 -0.894287 -1.550663 -0.282028 -0.537922

In [117]:
df1.iloc[1:5, 2:4]

          4         6
2 -1.659930 -0.029844
4 -0.282028 -0.537922
6  0.454570  0.056707
8  0.013645 -0.450921

In [118]:
df1.iloc[[1, 3, 5], [1, 3]]

           2         6
2   0.356211 -0.029844
6   0.346913  0.056707
10 -1.586541  0.357855

In [119]:
df1.iloc[1:3, :]

          0         2         4         6
2  0.084384  0.356211 -1.659930 -0.029844
4 -0.894287 -1.550663 -0.282028 -0.537922

In [120]:
df1.iloc[:, 1:3]

           2         4
0   0.409596 -0.070671
2   0.356211 -1.659930
4  -1.550663 -0.282028
6   0.346913  0.454570
8   0.583622  0.013645
10 -1.586541  2.090660

In [121]:
# this is also equivalent to ``df1.iat[1,1]``

df1.iloc[1, 1]

0.35621144061335985

In [122]:
df1.iloc[1]

0    0.084384
2    0.356211
4   -1.659930
6   -0.029844
Name: 2, dtype: float64

In [123]:
# these are allowed in Python/NumPy.

x = list('abcdef')

x

['a', 'b', 'c', 'd', 'e', 'f']

In [124]:
x[4:10]

['e', 'f']

In [125]:
x[8:10]

[]

In [126]:
s = pd.Series(x)

s

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [127]:
s.iloc[4:10]

4    e
5    f
dtype: object

In [128]:
s.iloc[8:10]

Series([], dtype: object)

In [129]:
dfl = pd.DataFrame(np.random.randn(5, 2), columns=list('AB'))

dfl

          A         B
0  0.218802 -1.775008
1 -0.574953  0.179797
2 -0.383485  1.912479
3  2.355146 -0.716785
4 -0.385262 -0.003679

In [130]:
dfl.iloc[:, 2:3]

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [131]:
dfl.iloc[:, 1:3]

          B
0 -1.775008
1  0.179797
2  1.912479
3 -0.716785
4 -0.003679

In [132]:
dfl.iloc[4:6]

          A         B
4 -0.385262 -0.003679

In [133]:
df1 = pd.DataFrame(np.random.randn(6, 4),

                   index=list('abcdef'),

                   columns=list('ABCD'))



df1

          A         B         C         D
a -2.193161 -0.338703  1.333438  0.367182
b  1.200620 -0.491648  0.820218  1.526450
c -2.335693 -0.445580 -0.383015 -0.214711
d -0.689168 -0.649028 -0.310956  1.742669
e  1.406105  0.077866  0.941250 -0.325766
f -0.499253 -1.093836 -3.054311 -0.132807

In [134]:
df1.loc[lambda df: df['A'] > 0, :]

          A         B         C         D
b  1.200620 -0.491648  0.820218  1.526450
e  1.406105  0.077866  0.941250 -0.325766

In [135]:
df1.loc[:, lambda df: ['A', 'B']]

          A         B
a -2.193161 -0.338703
b  1.200620 -0.491648
c -2.335693 -0.445580
d -0.689168 -0.649028
e  1.406105  0.077866
f -0.499253 -1.093836

In [136]:
df1.iloc[:, lambda df: [0, 1]]

          A         B
a -2.193161 -0.338703
b  1.200620 -0.491648
c -2.335693 -0.445580
d -0.689168 -0.649028
e  1.406105  0.077866
f -0.499253 -1.093836

In [ ]:
df1[lambda df: df.columns[0]]

In [138]:
df1['A'].loc[lambda s: s > 0]

b    1.200620
e    1.406105
Name: A, dtype: float64

In [144]:
bb.groupby(['year', 'team']).sum(numeric_only=True).head(10)

           stint    g   ab   r    h  X2b  X3b  hr   rbi   sb   cs  bb    so  \
year team
2006 ARI       1  153  586  93  159   52    2  15  73.0  0.0  1.0  69  58.0
     BOS       1   31    2   0    1    0    0   0   0.0  0.0  0.0   0   1.0
     CHN       2   19   50   6   14    1    0   1   2.0  1.0  1.0   4   4.0
     LAN       1   28   26   2    5    1    0   0   0.0  0.0  0.0   1   7.0
     MIL       1   20    3   0    0    0    0   0   0.0  0.0  0.0   0   2.0
     NYA       2   95    6   0    1    0    0   0   0.0  0.0  0.0   0   4.0
     SFN       1  139  426  66  105   21   12   6  40.0  7.0  0.0  46  55.0
2007 ARI       5   46   55   6    9    4    0   0   6.0  0.0  0.0   5  13.0
     ATL       4   92   94   2   15    4    0   0  10.0  0.0  0.0   5  29.0
     BAL       2   76  174  17   51   10    1   1  16.0  1.0  2.0  10  23.0

            ibb  hbp    sh   sf  gidp
year team
2006 ARI   10.0  7.0   0.0  6.0  14.0
     BOS    0.0  0.0   0.0  0.0   0.0
     CHN    0.0  0.0   3.0  0.0   0.0
     LAN    0.0  0.0   6.0  0.0   1.0
     MIL    0.0  0.0   0.0  0.0   0.0
     NYA    0.0  0.0   0.0  0.0   0.0
     SFN    2.0  2.0   3.0  4.0   6.0
2007 ARI    0.0  0.0   2.0  0.0   1.0
     ATL    1.0  0.0  13.0  1.0   1.0
     BAL    1.0  0.0   5.0  1.0   5.0

In [142]:
bb = pd.read_csv(r'C:\Users\YOSSI\baseball.csv', index_col='id')

(bb.groupby(['year', 'team']).sum(numeric_only=True)

   .loc[lambda df: df['r'] > 100])

           stint    g    ab    r    h  X2b  X3b  hr    rbi    sb   cs   bb  \
year team
2007 CIN       6  379   745  101  203   35    2  36  125.0  10.0  1.0  105
     DET       5  301  1062  162  283   54    4  37  144.0  24.0  7.0   97
     HOU       4  311   926  109  218   47    6  14   77.0  10.0  4.0   60
     LAN      11  413  1021  153  293   61    3  36  154.0   7.0  5.0  114
     NYN      13  622  1854  240  509  101    3  61  243.0  22.0  4.0  174
     SFN       5  482  1305  198  337   67    6  40  171.0  26.0  7.0  235
     TEX       2  198   729  115  200   40    4  28  115.0  21.0  4.0   73
     TOR       4  459  1408  187  378   96    2  58  223.0   4.0  2.0  190

              so   ibb   hbp    sh    sf  gidp
year team
2007 CIN   127.0  14.0   1.0   1.0  15.0  18.0
     DET   176.0   3.0  10.0   4.0   8.0  28.0
     HOU   212.0   3.0   9.0  16.0   6.0  17.0
     LAN   141.0   8.0   9.0   3.0   8.0  29.0
     NYN   310.0  24.0  23.0  18.0  15.0  48.0
     SFN   188.0  51.0   8.0  16.0   6.0  41.0
     TEX   140.0   4.0   5.0   2.0   8.0  16.0
     TOR   265.0  16.0  12.0   4.0  16.0  38.0

In [145]:
dfd = pd.DataFrame({'A': [1, 2, 3],

                    'B': [4, 5, 6]},

                   index=list('abc'))



dfd

   A  B
a  1  4
b  2  5
c  3  6

In [146]:
dfd.loc[dfd.index[[0, 2]], 'A']

a    1
c    3
Name: A, dtype: int64

In [147]:
dfd.iloc[[0, 2], dfd.columns.get_loc('A')]

a    1
c    3
Name: A, dtype: int64

In [148]:
dfd.iloc[[0, 2], dfd.columns.get_indexer(['A', 'B'])]

   A  B
a  1  4
c  3  6

In [150]:
s = pd.Series([1, 2, 3])
s

0    1
1    2
2    3
dtype: int64

In [151]:
s.reindex([1, 2, 3])

1    2.0
2    3.0
3    NaN
dtype: float64

In [152]:
labels = [1, 2, 3]

s.loc[s.index.intersection(labels)]

1    2
2    3
dtype: int64

In [154]:
s = pd.Series(np.arange(4), index=['a', 'a', 'b', 'c'])

labels = ['c', 'd']

In [155]:
s

a    0
a    1
b    2
c    3
dtype: int32

In [156]:
s.loc[s.index.intersection(labels)].reindex(labels)

c    3.0
d    NaN
dtype: float64

In [158]:
s = pd.Series([0, 1, 2, 3, 4, 5])
s

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [159]:
# When no arguments are passed, returns 1 row.

s.sample()

1    1
dtype: int64

In [160]:
# One may specify either a number of rows:

s.sample(n=3)

5    5
0    0
3    3
dtype: int64

In [161]:
# Or a fraction of the rows:

s.sample(frac=0.5)

0    0
2    2
4    4
dtype: int64

In [162]:
s = pd.Series([0, 1, 2, 3, 4, 5])

# Without replacement (default):

s.sample(n=6, replace=False)

4    4
2    2
5    5
3    3
1    1
0    0
dtype: int64

In [163]:
# With replacement:

s.sample(n=6, replace=True)

4    4
5    5
0    0
3    3
0    0
2    2
dtype: int64

In [164]:
s = pd.Series([0, 1, 2, 3, 4, 5])

example_weights = [0, 0, 0.2, 0.2, 0.2, 0.4]

s.sample(n=3, weights=example_weights)

5    5
4    4
3    3
dtype: int64

In [165]:
# Weights will be re-normalized automatically

example_weights2 = [0.5, 0, 0, 0, 0, 0]

s.sample(n=1, weights=example_weights2)

0    0
dtype: int64

In [166]:
df2 = pd.DataFrame({'col1': [9, 8, 7, 6],

                    'weight_column': [0.5, 0.4, 0.1, 0]})



df2.sample(n=3, weights='weight_column')

   col1  weight_column
1     8            0.4
0     9            0.5
2     7            0.1

In [167]:
df3 = pd.DataFrame({'col1': [1, 2, 3], 'col2': [2, 3, 4]})

df3.sample(n=1, axis=1)

   col2
0     2
1     3
2     4